#include <stdio.h>
#include <iostream>
#include <math.h>
using namespace std;
int main() {
	setlocale(0, "");
	int x1, x2, y1, y2, k, f, l, s, kon, dx, dy;
	printf("Введите координаты точек К1 и К2\n");
	scanf_s("%d%d%d%d", &x1, &y1, &x2, &y2);
	dx = abs(x1 - x2);
	dy = abs(y1 - y2);
	if (x1 < 0 || x1>8 || x2 < 0 || x2>8 || y1 > 8 || y1 < 0 || y2>8 || y2 < 0) {
		printf("Точки за пределами шахматной доски");
	}
	else {
		printf("Введите название фигуры, где 1-король,2-ферзь,3-ладья,4-слон,5-конь, после введенного значения проставьте 4 нуля");
		scanf_s("%d%d%d%d%d", &k, &f, &l, &s, &kon);
		if (k == 1 && f == 0 && l == 0 && s == 0 && kon == 0) {
			if ((abs(x1 - x2) <= 1) && (abs(y1 - y2) <= 1) || (x1 == 0 && x2 == 0 && y1 == 0 && y2 == 0))
				printf("Фигура может перейти за один ход из одой точки в другую");
			else {
				if (abs(x1 - x2) == abs(y1 - y2) || x1 == x2 || y1 == y2)
					printf("Ферзь может попасть");
				if (x1 == x2 || y1 == y2)
					printf("Ладья может попасть");
				if (abs(x1 - x2) == abs(y1 - y2))
					printf("Слон может попасть");
				if (dx == 1 && dy == 2 || dx == 2 && dy == 1)
					printf("Конь может попасть");
			}
		}
		if (k == 0 && f == 1 && l == 0 && s == 0 && kon == 0) {
			if (((abs(x1 - x2) == abs(y1 - y2) || x1 == x2 || y1 == y2)) || (x1 == 0 && x2 == 0 && y1 == 0 && y2 == 0))
				printf("Фигура может перейти за один ход из одой точки в другую");
			else {
				if ((abs(x1 - x2) <= 1) && (abs(y1 - y2) <= 1))
					printf("Король может попасть");
				if (x1 == x2 || y1 == y2)
					printf("Ладья может попасть");
				if (abs(x1 - x2) == abs(y1 - y2))
					printf("Слон может попасть");
				if (dx == 1 && dy == 2 || dx == 2 && dy == 1)
					printf("Конь может попасть");
			}
		}
		if (k == 0 && f == 0 && l == 1 && s == 0 && kon == 0) {
			if ((x1 == x2 || y1 == y2) || (x1 == 0 && x2 == 0 && y1 == 0 && y2 == 0))
				printf("Фигура может перейти за один ход из одой точки в другую");
			else {
				if ((abs(x1 - x2) <= 1) && (abs(y1 - y2) <= 1))
					printf("Король может попасть");
				if (abs(x1 - x2) == abs(y1 - y2) || x1 == x2 || y1 == y2)
					printf("Ферзь может попасть");
				if (abs(x1 - x2) == abs(y1 - y2))
					printf("Слон может попасть");
				if (dx == 1 && dy == 2 || dx == 2 && dy == 1)
					printf("Конь может попасть");
			}
		}
		if (k == 0 && f == 0 && l == 0 && s == 1 && kon == 0) {
			if ((abs(x1 - x2) == abs(y1 - y2)) || (x1 == 0 && x2 == 0 && y1 == 0 && y2 == 0))
				printf("Фигура может перейти за один ход из одой точки в другую");
			else {
				if ((abs(x1 - x2) <= 1) && (abs(y1 - y2) <= 1))
					printf("Король может попасть");
				if (abs(x1 - x2) == abs(y1 - y2) || x1 == x2 || y1 == y2)
					printf("Ферзь может попасть");
				if (x1 == x2 || y1 == y2)
					printf("Ладья может попасть");
				if (dx == 1 && dy == 2 || dx == 2 && dy == 1)
					printf("Конь может попасть");
			}
		}
		if (k == 0 && f == 0 && l == 0 && s == 0 && kon == 1) {
			if (((dx == 1 && dy == 2 || dx == 2 && dy == 1)) || (x1 == 0 && x2 == 0 && y1 == 0 && y2 == 0))
				printf("Фигура может перейти за один ход из одой точки в другую");
			else {
				if ((abs(x1 - x2) <= 1) && (abs(y1 - y2) <= 1))
					printf("Король может попасть");
				if (abs(x1 - x2) == abs(y1 - y2) || x1 == x2 || y1 == y2)
					printf("Ферзь может попасть");
				if (x1 == x2 || y1 == y2)
					printf("Ладья может попасть");
				if (abs(x1 - x2) == abs(y1 - y2))
					printf("Слон может попасть");
			}
		}
		return 0;
	}
}